{"components/ob-custom/faq/faq-general":"<div class=\"faq-block\">\r\n    <div class=\"title-toggle\">\r\n        <p>Why choose MyFitFoods?</p>\r\n        <span class=\"toggle-icon\">-</span>\r\n    </div>\r\n    <div class=\"faq-answer\">\r\n    \t<p>Unlike other meal prep companies, you're more than just a customer to us. We are committed to your success, and go beyond being just the food you eat.</p>\r\n\t\t<p>Providing the community that you need to make sure you hit your goals from our on site nutritionist to our massive community of clients working together to reach similar health goals.</p>\r\n\t\t<p>We go beyond the food to help you make the change!</p>\r\n    </div>\r\n</div>\r\n<div class=\"faq-block\">\r\n    <div class=\"title-toggle\">\r\n        <p>Where are your meals prepared?</p>\r\n        <span class=\"toggle-icon\">+</span>\r\n    </div>\r\n    <div class=\"faq-answer\">\r\n    \t<p>We receive shipments of fresh raw food daily, cook daily at our local kitchens and deliver fresh to each store daily!</p>\r\n    </div>\r\n</div>\r\n<div class=\"faq-block\">\r\n    <div class=\"title-toggle\">\r\n        <p>What's MyFitLife?</p>\r\n        <span class=\"toggle-icon\">+</span>\r\n    </div>\r\n    <div class=\"faq-answer\">\r\n    \t<p>MyFitLife is the perfect starting point for people who want results! We custom tailor, create and educate you on a nutritional plan designed to fit your lifestyle.</p>\r\n\t\t<p>You’ll have every meal and snack covered for the next 21 days based on your goals. Developing good eating habits and getting results is what it’s all about.</p>\r\n\t\t<p>Join MyFitLife and get the results you deserve.</p>\r\n    </div>\r\n</div>\r\n<div class=\"faq-block\">\r\n    <div class=\"title-toggle\">\r\n        <p>What's the FitClub?</p>\r\n        <span class=\"toggle-icon\">+</span>\r\n    </div>\r\n    <div class=\"faq-answer\">\r\n    \t<p>Fit Club is our discount membership program; we provide members a 20% discount on all food for only $10 a month!</p>\r\n    </div>\r\n</div>\r\n<div class=\"faq-block\">\r\n    <div class=\"title-toggle\">\r\n        <p>Will MyFitFoods meals help me lose weight?</p>\r\n        <span class=\"toggle-icon\">+</span>\r\n    </div>\r\n    <div class=\"faq-answer\">\r\n    \t<p>Getting the best results are on a client by client basis. We have many testimonials Click here from clients who have had excellent results on the 21DC.</p>\r\n\t\t<p>We have found that people who eat our food, exercise and stay hydrated have lost anywhere from 1-19 pounds on their 21 day challenge. Results vary from person to person.</p>\r\n    </div>\r\n</div>\r\n<div class=\"faq-block\">\r\n    <div class=\"title-toggle\">\r\n        <p>What if I'm still hungry?</p>\r\n        <span class=\"toggle-icon\">+</span>\r\n    </div>\r\n    <div class=\"faq-answer\">\r\n    \t<p>Hunger can come from a variety of things.</p>\r\n\t\t<p>Are you hydrated? Eating enough calories per day? Are you getting quality fiber? The list goes on and on.</p>\r\n\t\t<p>Why not come on in and talk to one of our nutritional consultants? Set up an appointment today!</p>\r\n    </div>\r\n</div>\r\n<div class=\"faq-block\">\r\n    <div class=\"title-toggle\">\r\n        <p>Can you help me reach my goal?</p>\r\n        <span class=\"toggle-icon\">+</span>\r\n    </div>\r\n    <div class=\"faq-answer\">\r\n    \t<p>Yes, we can help! Our #1 mission is to help people get the best results possible! Visit our storefront or reach out to us at contactus@myfitfoods.com and tell us your goal! We'll help you get started.</p>\r\n    </div>\r\n</div>\r\n<div class=\"faq-block\">\r\n    <div class=\"title-toggle\">\r\n        <p>How often does the MyFitFoods menu change?</p>\r\n        <span class=\"toggle-icon\">+</span>\r\n    </div>\r\n    <div class=\"faq-answer\">\r\n    \t<p>Every quarter we have our professional chefs add 2 new menu items for Breakfast, Lunch, Dinner!</p>\r\n\t\t<p>We want to make sure your choices are fresh and exciting!</p>\r\n    </div>\r\n</div>\r\n<div class=\"faq-block\">\r\n    <div class=\"title-toggle\">\r\n        <p>How long should my MyFitFoods meals stay fresh?</p>\r\n        <span class=\"toggle-icon\">+</span>\r\n    </div>\r\n    <div class=\"faq-answer\">\r\n    \t<p>Each meal can last 5-6 days in your fridge or toss them into your freezer to enjoy for up to 4 weeks.</p>\r\n\t\t<p>No special prep is required for your meals and they can go directly into the freezer as is.</p>\r\n\t\t<p>Also, you do not need to worry about thawing meals. As they can go from freezer to microwave and enjoyed in less than a few minutes.</p>\r\n    </div>\r\n</div>\r\n<div class=\"faq-block\">\r\n    <div class=\"title-toggle\">\r\n        <p>How do you prepare MyFitFoods meals?</p>\r\n        <span class=\"toggle-icon\">+</span>\r\n    </div>\r\n    <div class=\"faq-answer\">\r\n    \t<p>Our goal is to take the hassle out of healthy eating, so all you have to do is heat and eat.</p>\r\n\t\t<p>Each meal is designed to take less than 90 seconds from fridge to plate.</p>\r\n\t\t<p>Just toss in the microwave to heat up and enjoy! (If you previously froze your meal it might take a few minutes to get to temp.)</p>\r\n\t\t<p>You can also reheat your food on the stove or in the oven if you prefer.</p>\r\n    </div>\r\n</div>\r\n"}
