{"components/ob-custom/why-mff/meet-mario":"<div class=\"ob-content-panel ob-content-panel-75 meet-mario\">\r\n\t<div class=\"container\">\r\n\t\t<div class=\"title-head\">\r\n\t\t\t<h2 class=\"ob-heading-lg\">A LETTER FROM OUR FOUNDER</h2>\r\n\t\t</div>\r\n\t\t<p>In 2018 MyFitFoods was re-started for several reasons</p>\r\n\r\n<p>You deserve the best</p>\r\n\r\n<p>We all need a place to eat where the food is healthy, tasty, and affordable.  A place where the staff cares about our health and fitness even when we don't. A place where the service is so good, we talk about it.  As a former personal trainer, this is the place of my dreams.</p>\r\n\r\n<p>Being healthy is a full time important job that you are in charge of. Staying fit is not easy and even harder to maintain long-term.  What about when we want to lose fat and keep that off… even harder. It would be best to have a good coach, good food, and accountability for lasting results. Myself and the team have made the preventative side of healthy affordable, doable, and almost enjoyable. That’s how it should be.</p>\r\n\r\n<p>MyFitLife</p>\r\n\r\n<p>I had my nutritional world flipped upside down by a Ph.D. named Dr. House.  Learning the most up-to-date studies researched by a team of Ph.D.'s has been eye-opening, and I can't wait to share MyFitLife with you. The 21-Day Challenge was an awesome way to kick start a change.  MyFitLife has turned into the natural evolution of the 21DC.  We all need a good coach to keep us focused on getting to our goals, and then keeping them long-term.  Let us know what your goal is and we will make it happen. Wether it's Fat Loss, Muscle Gain, Increased Energy Levels or a combination, we've got you covered! Did you know you can actually lose body fat and gain healthy lean body mass at the same time? Talk about awesome.</p>\r\n\r\n<p>BFF’s aka Best Fit Friends</p>\r\n\r\n<p>If you need additional fitness help, our BFF's - Best Fit Friends will make sure you get what you need to be your healthiest. \r\n When it comes to fitness professionals, we work with and are supported by the very best. We take care of our BFF's, \r\n and all we ask in return is that they take good care of you.  Need a place to workout at, a trainer, a chiropractor, a doctor, \r\n a masseuse, a yoga instructor, need to be stretched, what ever you need we know the best!\r\n\r\n<p>Employees should have a great workplace\r\n\r\n<p>Employees deserve a workplace where respect and dignity are commonplace and this weighed heavily on the recreation of MyFitFoods.  The pay should be fair, profits shared, and the benefits generous.  We provide employees with leadership focused on growing their minds, feeding their souls, and creating hope for future growth.  At MFF we work hard every day, we love what we do, and that's taking care of you and each other.</p>\r\n\r\n<p>MyFitFoods and Give A Fit\r\n\r\n<p>It was important to position the company to be able to take care of people in need.  For every four meals purchased at MFF, we donate one meal to various local and national non-profits providing for people and families in need.  This makes all of us proud, yourself included, as you are a crucial part of the team. Our company tag-line \"GIVE A FIT\" says it all.  Join our fit family, and let's do the right thing by supporting those in need.  So far this year we’ve donated over 85,000 meals to people in need.  Thank you Sarah Tunstill for setting this up in each market.</p>\r\n\r\n<p>Starting, failing and getting up again</p>\r\n\r\n<p>It was hard starting MFF V1 from the ground up.  It was hard watching MyFitFoods being ran by a different management team, being kicked out of the company I started, and watching all the core values disappear. I was kicked out several years before the doors closed and the company went bankrupt.  Luckily, I managed to purchase the trademark *MyFitFoods (the name only) from the bankruptcy courts in 2019.  I am dedicated to making sure MFF’s runs as well as she can for all of us.</p>\r\n\r\n<p>Failure is never final. When you have a hard time in life, your fate is in your hands.  Take ownership, learn, grow and get on with it.</p>\r\n\r\n<p>Re-starting from scratch the second time was incredibly hard. I’d like to thank a few good people here.  Nick Travaille, Aaron Persels, Tim Watson, Aaron Dorland, Joe Pesina, Ben Thompson, Charles Mercer, Anthony Proctor, Tyler Harris, Lisa Drew, Justin Williams, Ben House and of course Thunder. You all have been as dedicated, if not more dedicated to MyFitFoods than me. Thank you.</p>\r\n\r\n<p>This time around, MFF is being done the right way with the right intentions and with the right fitness minded people. I asked myself what would make me happy in life. To work with the right team dedicated to serving and taking care of people.  It is with this mindset the entire team approaches life at MyFitFoods. We give our all to you.</p>\r\n\r\n<p>This is why I re-founded MyFitFoods. It has been challenging, but 100% worth it. We all need a company we can trust, people who look out for our health, and who have our well-being in mind. We are here for you, and we are MyFitFoods.</p>\r\n\r\n<p>To your health,</p>\r\n\r\n<p>Mario M<br>\r\nFounder<br>\r\nMyFitFoods</p>\r\n\t</div>\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n"}
